app/controllers/listy_controller.rb

SELECT id, zadania_count, nazwa, permalink FROM `listy` WHERE (`listy`.uzytkownik_id = 1) ORDER BY created_at AND zadania_count DESC
---
  def index
    @listy = self.current_uzytkownik.listy.find_for_index

SELECT id, zadania_count, nazwa, permalink FROM `listy` WHERE (`listy`.uzytkownik_id = 1) ORDER BY created_at AND zadania_count DESC
---
  def tag
    if params[:tag_id] == 'all'
      @listy = self.current_uzytkownik.listy.find_for_index

SELECT * FROM `listy` WHERE (`listy`.`permalink` = '7ifm5c7') AND (`listy`.uzytkownik_id = 1) LIMIT 1
---
  def edit
    begin
      @lista = self.current_uzytkownik.listy.find_by_permalink(params[:id])

INSERT INTO `listy` (`opis`, `permalink`, `updated_at`, `udostepnienie`, `pokaz_w_publicznych`, `nazwa`, `uzytkownik_id`, `zadania_count`, `pokaz_czas_ukonczenia`, `created_at`) VALUES('Zmiany jakie muszę zrobić w serwisie', NULL, '2009-01-03 14:12:34', 0, 1, 'Do zrobienia.pl', 1, 0, 0, '2009-01-03 14:12:34')
UPDATE `listy` SET `permalink` = '769q66c', `updated_at` = '2009-01-03 14:12:35' WHERE `id` = 4
---
  def create
    @lista = self.current_uzytkownik.listy.create(params[:lista])

    respond_to do |format|
      if @lista.save

SELECT * FROM `listy` WHERE (`listy`.`permalink` = '7ifm5c7') AND (`listy`.uzytkownik_id = 1) LIMIT 1
UPDATE `listy` SET `pokaz_czas_ukonczenia` = 1, `updated_at` = '2009-01-03 13:57:22', `udostepnienie` = 1 WHERE `id` = 3
DELETE FROM `subskrypcje` WHERE `id` = 1
---
  def update
    @lista = self.current_uzytkownik.listy.find_by_permalink(params[:id])
    respond_to do |format|
      if @lista.update_attributes(params[:lista])
        @lista.subskrypcje.destroy_all if @lista.udostepnienie == 0

INSERT INTO `subskrypcje` (`lista_id`, `uzytkownik_id`) VALUES(3, 1)
---
  def subskrybuj
    begin
      lista = Lista.find_by_permalink(params[:id], :select => "id, udostepnienie, permalink")
      if lista.udostepnienie == 1
        unless s = subskrybuje?(lista)
          sub = lista.subskrypcje.new
          sub.uzytkownik_id = self.current_uzytkownik.id
          sub.save

SELECT id, udostepnienie, pokaz_czas_ukonczenia, permalink, pokaz_w_publicznych FROM `listy` WHERE (`listy`.`permalink` = '7ifm5c7') AND (`listy`.uzytkownik_id = 1) LIMIT 1
---
  def udostepnij
    begin
      @lista = self.current_uzytkownik.listy.find_by_permalink(params[:id])

SELECT * FROM `listy` WHERE (`listy`.`permalink` = '8srk8hs') AND (`listy`.uzytkownik_id = 1) LIMIT 1
DELETE FROM `listy` WHERE `id` = 1
---
  def destroy
    @lista = self.current_uzytkownik.listy.find_by_permalink(params[:id])
    @lista.destroy