app/controllers/zadania_controller.rb

  def index
    @lista = Lista.find_by_permalink(params[:lista_id])
    @zadania = @lista.zadania.find_ordered.group_by(&:zrobione)
---
SELECT * FROM `zadania` WHERE (`zadania`.lista_id = 1) ORDER BY `order`

  def order
    respond_to do |format|
      format.html { redirect_to :action => "index" }
      format.js do
          params[:do_zrobienia].each_with_index do |id, index|
            temp = @lista.zadania.find(id, :select => "id,lista_id, `order`")
            unless temp.order == index
              temp.not_cache_counter = true
              temp.update_attribute :order, index
---
SELECT id,lista_id, `order` FROM `zadania` WHERE (`zadania`.`id` = 15 AND (`zadania`.lista_id = 4))
UPDATE `zadania` SET `order` = 0, `updated_at` = '2009-01-03 14:14:14' WHERE `id` = 15

  def toggle
    respond_to do |format|
      format.html { redirect_to lista_zadania_path( @lista ) }
      format.js do
        @zadanie = @lista.zadania.find(params[:id], :select => "id, zrobione, nazwa, lista_id, `order`")

        @zadanie.toggle(:zrobione)
---
SELECT id, zrobione, nazwa, lista_id, `order` FROM `zadania` WHERE (`zadania`.`id` = 12 AND (`zadania`.lista_id = 3))
UPDATE `zadania` SET `order` = 1, `zrobione` = 0, `updated_at` = '2009-01-03 13:51:16' WHERE `id` = 12

  def create
    @zadanie = @lista.zadania.new(params[:zadanie])
    @zadanie.order!
    respond_to do |format|
      if @zadanie.save
---
INSERT INTO `zadania` (`zrobione`, `lista_id`, `updated_at`, `order`, `nazwa`, `created_at`) VALUES(0, 3, '2009-01-03 14:00:26', 2, 'test', '2009-01-03 14:00:26')

  def update
    @zadanie = @lista.zadania.find(params[:id], :select => "id, lista_id, nazwa")
    msg = "zmiana zadania '#{@zadanie.nazwa}'"
    respond_to do |format|
      if @zadanie.update_attributes(params[:zadanie])
---
SELECT id, lista_id, nazwa FROM `zadania` WHERE (`zadania`.`id` = 19 AND (`zadania`.lista_id = 4))
UPDATE `zadania` SET `nazwa` = 'Test', `updated_at` = '2009-01-03 17:55:20' WHERE `id` = 19

  def destroy
    @zadanie = @lista.zadania.find(params[:id], :select => "id, lista_id, nazwa")
    aktualizuj_subskrypcje @lista, "usunięto zadanie '#{@zadanie.nazwa}'"
    @zadanie.destroy
---
SELECT id, lista_id, nazwa FROM `zadania` WHERE (`zadania`.`id` = 13 AND (`zadania`.lista_id = 3))
DELETE FROM `zadania` WHERE `id` = 13